PerfomanceTests/results/npgsqlrest-perf_test_record_arrays-10rec.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: api-test.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
           * breaking: Up to 100 looping VUs for 1m0s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/100 VUs, 1428 complete and 0 interrupted iterations
breaking   [   2% ] 002/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 004/100 VUs, 3641 complete and 0 interrupted iterations
breaking   [   3% ] 004/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 005/100 VUs, 6527 complete and 0 interrupted iterations
breaking   [   5% ] 005/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 007/100 VUs, 9676 complete and 0 interrupted iterations
breaking   [   7% ] 007/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 009/100 VUs, 13407 complete and 0 interrupted iterations
breaking   [   8% ] 009/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 010/100 VUs, 17505 complete and 0 interrupted iterations
breaking   [  10% ] 010/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 012/100 VUs, 21905 complete and 0 interrupted iterations
breaking   [  12% ] 012/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 014/100 VUs, 26633 complete and 0 interrupted iterations
breaking   [  13% ] 014/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 015/100 VUs, 31503 complete and 0 interrupted iterations
breaking   [  15% ] 015/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 017/100 VUs, 36649 complete and 0 interrupted iterations
breaking   [  17% ] 017/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 019/100 VUs, 41915 complete and 0 interrupted iterations
breaking   [  18% ] 019/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 020/100 VUs, 47572 complete and 0 interrupted iterations
breaking   [  20% ] 020/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 022/100 VUs, 53110 complete and 0 interrupted iterations
breaking   [  22% ] 022/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 024/100 VUs, 58699 complete and 0 interrupted iterations
breaking   [  23% ] 024/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 025/100 VUs, 64595 complete and 0 interrupted iterations
breaking   [  25% ] 025/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 027/100 VUs, 70618 complete and 0 interrupted iterations
breaking   [  27% ] 027/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 029/100 VUs, 76712 complete and 0 interrupted iterations
breaking   [  28% ] 029/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 030/100 VUs, 82891 complete and 0 interrupted iterations
breaking   [  30% ] 030/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 032/100 VUs, 89298 complete and 0 interrupted iterations
breaking   [  32% ] 032/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 033/100 VUs, 95623 complete and 0 interrupted iterations
breaking   [  33% ] 033/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 035/100 VUs, 102045 complete and 0 interrupted iterations
breaking   [  35% ] 035/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 037/100 VUs, 108373 complete and 0 interrupted iterations
breaking   [  37% ] 037/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 038/100 VUs, 115050 complete and 0 interrupted iterations
breaking   [  38% ] 038/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 040/100 VUs, 121564 complete and 0 interrupted iterations
breaking   [  40% ] 040/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 042/100 VUs, 128119 complete and 0 interrupted iterations
breaking   [  42% ] 042/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 043/100 VUs, 135087 complete and 0 interrupted iterations
breaking   [  43% ] 043/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 045/100 VUs, 141793 complete and 0 interrupted iterations
breaking   [  45% ] 045/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 047/100 VUs, 148568 complete and 0 interrupted iterations
breaking   [  47% ] 047/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 048/100 VUs, 155770 complete and 0 interrupted iterations
breaking   [  48% ] 048/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 050/100 VUs, 162516 complete and 0 interrupted iterations
breaking   [  50% ] 050/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 052/100 VUs, 169343 complete and 0 interrupted iterations
breaking   [  52% ] 052/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 053/100 VUs, 176436 complete and 0 interrupted iterations
breaking   [  53% ] 053/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 055/100 VUs, 183535 complete and 0 interrupted iterations
breaking   [  55% ] 055/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 057/100 VUs, 190421 complete and 0 interrupted iterations
breaking   [  57% ] 057/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 058/100 VUs, 197219 complete and 0 interrupted iterations
breaking   [  58% ] 058/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 060/100 VUs, 204590 complete and 0 interrupted iterations
breaking   [  60% ] 060/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 062/100 VUs, 211741 complete and 0 interrupted iterations
breaking   [  62% ] 062/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 063/100 VUs, 218941 complete and 0 interrupted iterations
breaking   [  63% ] 063/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 065/100 VUs, 225991 complete and 0 interrupted iterations
breaking   [  65% ] 065/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 066/100 VUs, 233497 complete and 0 interrupted iterations
breaking   [  67% ] 066/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 068/100 VUs, 240748 complete and 0 interrupted iterations
breaking   [  68% ] 068/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 070/100 VUs, 247714 complete and 0 interrupted iterations
breaking   [  70% ] 070/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 071/100 VUs, 255334 complete and 0 interrupted iterations
breaking   [  72% ] 071/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 073/100 VUs, 262762 complete and 0 interrupted iterations
breaking   [  73% ] 073/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 075/100 VUs, 270091 complete and 0 interrupted iterations
breaking   [  75% ] 075/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 076/100 VUs, 277302 complete and 0 interrupted iterations
breaking   [  77% ] 076/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 078/100 VUs, 284819 complete and 0 interrupted iterations
breaking   [  78% ] 078/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 080/100 VUs, 291902 complete and 0 interrupted iterations
breaking   [  80% ] 080/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 081/100 VUs, 299043 complete and 0 interrupted iterations
breaking   [  82% ] 081/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 083/100 VUs, 306837 complete and 0 interrupted iterations
breaking   [  83% ] 083/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 085/100 VUs, 313710 complete and 0 interrupted iterations
breaking   [  85% ] 085/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 086/100 VUs, 321212 complete and 0 interrupted iterations
breaking   [  87% ] 086/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 088/100 VUs, 328895 complete and 0 interrupted iterations
breaking   [  88% ] 088/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 090/100 VUs, 336150 complete and 0 interrupted iterations
breaking   [  90% ] 090/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 091/100 VUs, 343229 complete and 0 interrupted iterations
breaking   [  92% ] 091/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 093/100 VUs, 350225 complete and 0 interrupted iterations
breaking   [  93% ] 093/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 095/100 VUs, 357545 complete and 0 interrupted iterations
breaking   [  95% ] 095/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 096/100 VUs, 364928 complete and 0 interrupted iterations
breaking   [  97% ] 096/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 098/100 VUs, 372818 complete and 0 interrupted iterations
breaking   [  98% ] 098/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 099/100 VUs, 380469 complete and 0 interrupted iterations
breaking   [ 100% ] 099/100 VUs  1m00.0s/1m00.0s

     ✓ response code was 200

     checks.........................: 100.00% ✓ 380624      ✗ 0     
     data_received..................: 1.6 GB  27 MB/s
     data_sent......................: 98 MB   1.6 MB/s
     http_req_blocked...............: avg=4.94µs   min=558ns    med=2.91µs  max=19.18ms  p(90)=4.56µs   p(95)=5.26µs 
     http_req_connecting............: avg=166ns    min=0s       med=0s      max=7.46ms   p(90)=0s       p(95)=0s     
   ✓ http_req_duration..............: avg=7.64ms   min=609.55µs med=6.91ms  max=108.3ms  p(90)=13.56ms  p(95)=15.9ms 
       { expected_response:true }...: avg=7.64ms   min=609.55µs med=6.91ms  max=108.3ms  p(90)=13.56ms  p(95)=15.9ms 
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 380624
     http_req_receiving.............: avg=246.84µs min=13.44µs  med=50.99µs max=49.48ms  p(90)=215.49µs p(95)=871.9µs
     http_req_sending...............: avg=28.26µs  min=3.73µs   med=15.98µs max=29.06ms  p(90)=24.88µs  p(95)=32.42µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=7.37ms   min=559.35µs med=6.67ms  max=108.22ms p(90)=13.17ms  p(95)=15.4ms 
     http_reqs......................: 380624  6342.578023/s
     iteration_duration.............: avg=7.86ms   min=662.83µs med=7.1ms   max=108.5ms  p(90)=13.84ms  p(95)=16.24ms
     iterations.....................: 380624  6342.578023/s
     vus............................: 99      min=2         max=99  
     vus_max........................: 100     min=100       max=100 


running (1m00.0s), 000/100 VUs, 380624 complete and 0 interrupted iterations
breaking ✓ [ 100% ] 000/100 VUs  1m0s